<a href="https://colab.research.google.com/github/sbj6364/python-study/blob/main/pandas-basic/26_pivot_table.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 26번 : pivot table

직전 문제와 동일한 DataFrame 을 이용하여, label column을 기준으로 pivot table(피벗테이블)을 생성하는 코드를 작성해보세요.


#### 데이터
~~~
	val1 val2 val3 label
0	1	-1	2	A
1	2	-2	3	A
2	3	-3	4	B
3	4	-4	7	B
4	5	-5	8	B
~~~
#### output 참고
[FutureSkill 26](https://futureskill.io/content/903ab63c-2b24-4be0-ba1c-a3ba34dce258/question/4b30050a-f739-40c5-a7e8-0c04d6dfbc5c)

In [2]:
import pandas as pd
import numpy as np

ar = [[1,-1,2],
      [2,-2,3],
      [3,-3,4],
      [4,-4,7],
      [5,-5,8]]
label = ['A','A','B','B','B']

df = pd.DataFrame(ar, columns=['val1','val2','val3'])
df['label'] = label
df

   val1  val2  val3 label
0     1    -1     2     A
1     2    -2     3     A
2     3    -3     4     B
3     4    -4     7     B
4     5    -5     8     B

In [32]:
dfg = df.groupby(label)
pd.DataFrame(dfg.agg('mean'))

   val1  val2      val3
A   1.5  -1.5  2.500000
B   4.0  -4.0  6.333333

In [31]:
dfg = df.groupby(label).mean()
dfg

   val1  val2      val3
A   1.5  -1.5  2.500000
B   4.0  -4.0  6.333333

In [35]:
dfg = pd.pivot_table(df, index=label)
dfg

   val1  val2      val3
A   1.5  -1.5  2.500000
B   4.0  -4.0  6.333333